package main

var GenresData = []GenreData{
	{"Драма", "Фильмы, в которых основное внимание уделяется эмоциональному развитию персонажей и сложным жизненным ситуациям."},
	{"Комедия", "Фильмы с юмористическим сюжетом, целью которых является развлечение зрителей."},
	{"Ужасы", "Фильмы, направленные на создание у зрителя чувства страха, ужаса и тревоги."},
	{"Научная фантастика", "Фильмы научной фантастики, часто основанные на идеях о будущем и развитии технологий."},
	{"Романтика", "Фильмы, в которых основное внимание уделяется романтическим отношениям."},
	{"Триллер", "Фильмы с напряженным, захватывающим сюжетом, часто с элементами мистики или криминала."},
	{"Фэнтези", "Фильмы, в которых представлены вымышленные миры, магия и фантастические существа."},
	{"Приключения", "Фильмы, в которых главный акцент на приключениях и исследовании новых миров."},
	{"Документальный", "Фильмы, которые исследуют реальную жизнь, события или явления, часто с образовательной целью."},
	{"Анимация", "Фильмы, в которых используются различные методы анимации для создания визуального контента."},
	{"Мистика", "Фильмы с элементами расследования, разгадки тайны или преступления."},
}

var EquipmentTypesData = []EquipmentTypeData{
	{"LED", "Современные экраны, использующие светодиоды для отображения изображения с высокой яркостью и контрастностью."},
	{"LCD", "Жидкокристаллические экраны, обеспечивающие хорошее качество изображения и энергоэффективность."},
	{"DLP", "Цифровые проекторы на основе технологии цифровой обработки света, обеспечивающие высокое качество изображения."},
	{"OLED", "Экраны с органическими светодиодами, обеспечивающие глубокие черные цвета и широкий угол обзора."},
	{"Проекционный экран", "Экран, на который проецируется изображение с проектора."},
	{"Система 3D", "Оборудование для показа фильмов в 3D-формате, включая специальные экраны и очки."},
	{"IMAX", "Специальные экраны и проекторы для показа фильмов в формате IMAX, обеспечивающие уникальный опыт просмотра."},
	{"Сквозной экран", "Экран, который позволяет зрителям видеть изображение с обеих сторон."},
	{"Мобильный экран", "Переносные экраны, используемые для временных показов или мероприятий на открытом воздухе."},
	{"Система звука для экрана", "Оборудование, интегрированное с экраном для обеспечения качественного звука."},
}

var SeatTypesData = []SeatTypeData{
	{"Стандартное", "Обычное кресло для зрителей с комфортной посадкой."},
	{"VIP", "Комфортабельные кресла с дополнительными удобствами, такими как подставки для ног и увеличенное пространство."},
	{"Люкс", "Эксклюзивные места с повышенным комфортом, часто с возможностью заказа еды и напитков."},
	{"Кресло-качалка", "Кресло, которое может качаться, обеспечивая дополнительный комфорт."},
	{"Сиденье для инвалидов", "Специально оборудованные места для зрителей с ограниченными возможностями."},
	{"Семейное", "Места, предназначенные для семейных групп, часто расположенные рядом друг с другом."},
	{"Балкон", "Места, расположенные на верхнем уровне зала, обеспечивающие хороший обзор."},
	{"Премиум", "Места с лучшим расположением и дополнительными удобствами."},
	{"Кресло с подогревом", "Кресло, оснащенное функцией подогрева для дополнительного комфорта."},
	{"Кресло с массажем", "Кресло, которое предлагает функции массажа для расслабления зрителей."},
}

var TicketStatusesData = []TicketStatusData{
	{"Забронирован"},
	{"Куплен"},
	{"Возвращен"},
}
